

#brew "docker"
tap "homebrew/cask"

## Docker

#brew "docker-machine"
#brew "docker-compose"
#brew "docker-machine-driver-hyperkit"

#brew "hyperkit"
#brew "minikube"

## Mac OS Specific
brew "mas"
brew "dockutil"


## Console tools
brew "jq"
brew "tree"
brew "gnupg"
brew "tmux"

## Apps

cask "google-chrome"

cask "docker"
cask "virtualbox"
cask "virtualbox-extension-pack"


cask "rectangle"
cask "visual-studio-code"
cask "slack"
cask "spotify"
cask "vlc"

cask "notion"

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "quicklookase"
#cask "qlvideo"

whalebrew "whalebrew/awscli"
whalebrew "theserverlessway/awsinfo"