# To Use:
# ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap Homebrew/bundle
# brew bundle

# Show other installed stuff. Use --force to uninstall
# brew bundle cleanup

cask_args appdir: '~/Applications'
tap 'caskroom/cask'


# Usefull stuff
brew 'tmux'
brew 'jq'
brew 'tree'
brew 'openssl'
brew 'wget'
# npm bash-completion rbenv ruby-build

# Console everyday apps
brew 'mutt' # Mail client
brew 'gpg'
brew 'pass'

brew 'w3m' # Viewing sites
brew 'imagemagick'

# Dev stuff
brew 'node'
brew 'go'
brew 'heroku'

# git for Github
brew 'hub'

# Mac specific
brew 'mas' # Mac app store

# Mac bugfixing
brew 'reattach-to-user-namespace'

cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'skype'

# Need sudo
#cask 'gpgtools'
